"""
4.5. На відрізку [0, 2] знайдіть корінь рівняння
f(x) = 𝑥³ + 4𝑥² + 𝑥 − 6 = 0.

x = 0 => f = -6
x = 2 => f = 20

перша похідна
f` (x) = 3x^2 + 8x + 1 = 0
вітки вгору,
в 0 значення 1
в 2 значення 12+16+1 = 29
 насправді легко помітити що точка мінімуму для f` буде менше за 0 ,
 тому на відрізку [0, 2] наша функція зростає

"""

import user


def task_04_05():
    f = lambda x: x ** 3 + 4 * x ** 2 + x - 6
    a = 0.0
    b = 2.0
    c = 0.0
    r = user.solve(f, c, a, b)

    print(f"Корінь рівняння на відрізку [0, 2]: {r}")
    print(f"Перевірка : {f(r)}")


if __name__ == "__main__":
    task_04_05()






