"""
4.4. На відрізку [1.6, 3] знайдіть корінь рівняння
sin 𝑥 = 𝑥 / 3.


f(x) = sin(x) - x/3, тоді шукане значення c = 0


На відрізку [1.6, 3] функція синуса спадає, і
віднімання x/3 робить її ще більш спадною
"""

import math
import user


def task_4_4():
    f = lambda x: math.sin(x) - x / 3.0
    a = 1.6
    b = 3.0
    c = 0.0
    r = user.solve_decreasing(f, c, a, b)

    print(f"Корінь рівняння на відрізку [1.6, 3]: {r}")
    print(f"Перевірка : {f(r)}")


if __name__ == "__main__":
    task_4_4()