###abc

#Визначте час виконання програми у явному вигляді, якщо для нього
#відоме рекурентне співвідношення


#a) 𝑇(𝑛) = {
#           1,              𝑛 ≤ 𝑎, 𝑎 > 0;
#           𝑇(𝑛 − 𝑎) + 1,   𝑛 > a

#t(n - a) =  t(n - 2a) +1 = t(n-3a) +1 +2 =
#t(n) = t(n-k*a) +k
#n - a = ka
#k = n/a -1
#t(n) = t(a) + n/a -1 = 1 - 1 + n/a = n/2

#t(n) = n/2




###b) 𝑇(𝑛) = {
#                   1, 𝑛 = 0;
#                   𝑇(𝑛 − 1) + 2^𝑛, 𝑛 ≥ 1.

#t(n) = t(n - 1) + 2^n = t(n-2) + 2^(n-1)+(2^n) = t(n-3) +2^(n-2) +2^(n-1)+(2^n)
#=> t(0) + 2^1 +... +2^n = 2^(n+1) - 1
#t(0) = 1
#t(1) = 2 + 1 = 3 = 4-1
#t(2) = t(1) + 2^2 = 2^2 +2^1 = 8 -1
#t(3) = t(2) + 2^3  = 2^3 + 2^2 +2^1 +1 = 16 -1

#t(n) = 2^(n+1) - 1


'''c) 𝑇(𝑛) = {
                1, 𝑛 = 1;
                2𝑇([𝑛/2]) + 1, 𝑛 ≥ 2.               '''

# n = 2^m => m = log2(n)
#t(n) = t(2^m) = t(2^(m-1)) +1 = /// = t(1)+m = log2(n) +1










