#a, e, g


'''a) 𝑇(𝑛) = {
                𝑂(1), 𝑛 = 0;
                𝑇(𝑛 − 1) + 𝑂(1), 𝑛 ≥ 1'''



#t(0) = c
#t(1) = c+ c = 2c
#t(2) = 2c + c = 3c
#t(3) = 4c
#t(n) = (n+1) c  = O(n)


"""e) 𝑇(𝑛) = {
                𝑂(1), 𝑛 = 0;
                𝑇(𝑛 − 1) + 𝑂(𝑛), 𝑛 ≥ 1.
"""
#O(n) = n нехай
#t(n) = t(n-1) + n = t(n-2) + n-1 +n = t(n-3) +n-2 +n-1 +n
#t(n) = t(0) + 1+... + n = c+n(n+1)/2 <= O(n^2)


"""g) 𝑇(𝑛) = {
                𝑂(1), 𝑛 = 1;
                𝑎𝑇([𝑛/𝑎]) + 𝑂(1), 𝑛 ≥ 2, 𝑎 ≥ 2"""


#n = a^m => m = log_a(n)
#t(n) = t(a^m) = at(a^(m-1)) + c= a^2 * t(a^(m-2)) +ac +c =
# t(n) = a^m t(1) + (n-1)c\(a-1) = a^m (2c) = O(n)+O(n) = O(n)








